Revit 2027 API
ControlledApplication.VersionNumber Property
 Return the primary version of the Revit application.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string VersionNumber { get; }
Public ReadOnly Property VersionNumber As String
	Get
public:
property String^ VersionNumber {
	String^ get ();
}
member VersionNumber : string with get
Property Value
String
Remarks
 This property can be used by your application to find the version of Revit against which your application is running. Based on this information your application can report if it is able to work correctly with that version of Revit.
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace